renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/espressif/esp-idf/components/bt/bluedroid/stack/include/stack/avrc_defs.h
/* RegNotify */
typedef struct {
    UINT8       pdu;
    tAVRC_STS   status;
    UINT8       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    UINT8       event_id;
    UINT32      param;
} tAVRC_REG_NOTIF_CMD;

/* SetAddrPlayer */
typedef struct {
    UINT8       pdu;
    tAVRC_STS   status;
    UINT8       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    UINT16      player_id;
} tAVRC_SET_ADDR_PLAYER_CMD;

/* SetBrowsedPlayer */
typedef struct {
    UINT8       pdu;
    tAVRC_STS   status;
    UINT8       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    UINT16      player_id;
} tAVRC_SET_BR_PLAYER_CMD;

/* SetAbsVolume */
typedef struct {
    UINT8       pdu;
    tAVRC_STS   status;
    UINT8       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    UINT8       volume;
} tAVRC_SET_VOLUME_CMD;

/* GetFolderItems */
typedef struct {
    UINT8       pdu;
    tAVRC_STS   status;
    UINT8       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    UINT8       scope;
    UINT32      start_item;
    UINT32      end_item;
    UINT8       attr_count;
    UINT32      *p_attr_list;
} tAVRC_GET_ITEMS_CMD;

/* ChangePath */
typedef struct {
    UINT8       pdu;
    tAVRC_STS   status;
    UINT8       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    UINT16      uid_counter;
    UINT8       direction;
    tAVRC_UID   folder_uid;
} tAVRC_CHG_PATH_CMD;

/* GetItemAttrs */
typedef struct {
    UINT8       pdu;
    tAVRC_STS   status;
    UINT8       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    UINT8       scope;
    tAVRC_UID   uid;
    UINT16      uid_counter;
    UINT8       attr_count;
    UINT32      *p_attr_list;
} tAVRC_GET_ATTRS_CMD;

/* Search */
typedef struct {
    UINT8           pdu;
    tAVRC_STS       status;
    UINT8           opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    tAVRC_FULL_NAME string;
} tAVRC_SEARCH_CMD;

/* PlayItem */
typedef struct {
    UINT8       pdu;
    tAVRC_STS   status;
    UINT8       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    UINT8       scope;
    tAVRC_UID   uid;
    UINT16      uid_counter;
} tAVRC_PLAY_ITEM_CMD;

/* AddToNowPlaying */
typedef struct {
    UINT8       pdu;
    tAVRC_STS   status;
    UINT8       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    UINT8       scope;
    tAVRC_UID   uid;
    UINT16      uid_counter;
} tAVRC_ADD_TO_PLAY_CMD;

typedef struct {
    UINT8       pdu;
    tAVRC_STS   status;
    UINT8       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
} tAVRC_CMD;

/* Continue and Abort */
typedef struct {
    UINT8       pdu;
    tAVRC_STS   status;
    UINT8       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    UINT8       target_pdu;
} tAVRC_NEXT_CMD;

typedef union {
    UINT8                       pdu;
    tAVRC_CMD                   cmd;
    tAVRC_GET_CAPS_CMD          get_caps;               /* GetCapability */
    tAVRC_CMD                   list_app_attr;          /* ListPlayerAppAttr */
    tAVRC_LIST_APP_VALUES_CMD   list_app_values;        /* ListPlayerAppValues */
    tAVRC_GET_CUR_APP_VALUE_CMD get_cur_app_val;        /* GetCurAppValue */
    tAVRC_SET_APP_VALUE_CMD     set_app_val;            /* SetAppValue */
    tAVRC_GET_APP_ATTR_TXT_CMD  get_app_attr_txt;       /* GetAppAttrTxt */
    tAVRC_GET_APP_VAL_TXT_CMD   get_app_val_txt;        /* GetAppValueTxt */
    tAVRC_INFORM_CHARSET_CMD    inform_charset;         /* InformCharset */
    tAVRC_BATTERY_STATUS_CMD    inform_battery_status;  /* InformBatteryStatus */
    tAVRC_GET_ELEM_ATTRS_CMD    get_elem_attrs;         /* GetElemAttrs */
    tAVRC_CMD                   get_play_status;        /* GetPlayStatus */
    tAVRC_REG_NOTIF_CMD         reg_notif;              /* RegNotify */
    tAVRC_NEXT_CMD              continu;                /* Continue */
    tAVRC_NEXT_CMD              abort;                  /* Abort */

    tAVRC_SET_ADDR_PLAYER_CMD   addr_player;            /* SetAddrPlayer */
    tAVRC_SET_VOLUME_CMD        volume;                 /* SetAbsVolume */
    tAVRC_SET_BR_PLAYER_CMD     br_player;              /* SetBrowsedPlayer */
    tAVRC_GET_ITEMS_CMD         get_items;              /* GetFolderItems */
    tAVRC_CHG_PATH_CMD          chg_path;               /* ChangePath */
    tAVRC_GET_ATTRS_CMD         get_attrs;              /* GetItemAttrs */
    tAVRC_SEARCH_CMD            search;                 /* Search */
    tAVRC_PLAY_ITEM_CMD         play_item;              /* PlayItem */
    tAVRC_ADD_TO_PLAY_CMD       add_to_play;            /* AddToNowPlaying */
} tAVRC_COMMAND;

/* GetCapability */
typedef struct {
    UINT8       pdu;
    tAVRC_STS   status;
    UINT8       opcode;         /* Op Code (copied from avrc_cmd.opcode by AVRC_BldResponse user. invalid one to generate according to pdu) */
    UINT8       capability_id;
    UINT8       count;
    tAVRC_CAPS_PARAM param;
} tAVRC_GET_CAPS_RSP;

/* ListPlayerAppAttr */
typedef struct {
    UINT8       pdu;
    tAVRC_STS   status;
    UINT8       opcode;         /* Op Code (copied from avrc_cmd.opcode by AVRC_BldResponse user. invalid one to generate according to pdu) */
    UINT8       num_attr;
    UINT8       attrs[AVRC_MAX_APP_ATTR_SIZE];
} tAVRC_LIST_APP_ATTR_RSP;

/* ListPlayerAppValues */
typedef struct {
    UINT8       pdu;
    tAVRC_STS   status;
    UINT8       opcode;         /* Op Code (copied from avrc_cmd.opcode by AVRC_BldResponse user. invalid one to generate according to pdu) */
    UINT8       num_val;
    UINT8       vals[AVRC_MAX_APP_ATTR_SIZE];
} tAVRC_LIST_APP_VALUES_RSP;

